export const citys = {
  "p": [
    {
      "prov": {
        "name": "全国",
        "initial": "",
        "fullName": "全国"
      },
      "citys": [
        ""
      ]
    },
    {
      "prov": {
        "name": "直辖市",
        "initial": "Z",
        "fullName": "直辖市"
      },
      "citys": [
        "北京",
        "天津",
        "上海",
        "重庆"
      ]
    },
    {
      "prov": {
        "name": "特别行政区",
        "initial": "T",
        "fullName": "特别行政区"
      },
      "citys": [
        "香港",
        "澳门"
      ]
    },
    {
      "prov": {
        "name": "河北",
        "initial": "H",
        "fullName": "河北省"
      },
      "citys": [
        "石家庄",
        "唐山",
        "秦皇岛",
        "邯郸",
        "邢台",
        "保定",
        "张家口",
        "承德",
        "沧州",
        "廊坊",
        "衡水"
      ]
    },
    {
      "prov": {
        "name": "山西",
        "initial": "S",
        "fullName": "山西省"
      },
      "citys": [
        "太原",
        "大同",
        "阳泉",
        "长治",
        "晋城",
        "朔州",
        "晋中",
        "运城",
        "忻州",
        "临汾",
        "吕梁"
      ]
    },
    {
      "prov": {
        "name": "内蒙古",
        "initial": "N",
        "fullName": "内蒙古自治区"
      },
      "citys": [
        "呼和浩特",
        "包头",
        "乌海",
        "赤峰",
        "通辽",
        "鄂尔多斯",
        "呼伦贝尔",
        "巴彦淖尔",
        "乌兰察布",
        "兴安",
        "锡林郭勒",
        "阿拉善"
      ]
    },
    {
      "prov": {
        "name": "辽宁",
        "initial": "L",
        "fullName": "辽宁省"
      },
      "citys": [
        "沈阳",
        "大连",
        "鞍山",
        "抚顺",
        "本溪",
        "丹东",
        "锦州",
        "营口",
        "阜新",
        "辽阳",
        "盘锦",
        "铁岭",
        "朝阳",
        "葫芦岛"
      ]
    },
    {
      "prov": {
        "name": "吉林",
        "initial": "J",
        "fullName": "吉林省"
      },
      "citys": [
        "长春",
        "吉林",
        "四平",
        "辽源",
        "通化",
        "白山",
        "松原",
        "白城",
        "延边"
      ]
    },
    {
      "prov": {
        "name": "黑龙江",
        "initial": "H",
        "fullName": "黑龙江省"
      },
      "citys": [
        "哈尔滨",
        "齐齐哈尔",
        "鸡西",
        "鹤岗",
        "双鸭山",
        "大庆",
        "伊春",
        "佳木斯",
        "七台河",
        "牡丹江",
        "黑河",
        "绥化",
        "大兴安岭"
      ]
    },
    {
      "prov": {
        "name": "江苏",
        "initial": "J",
        "fullName": "江苏省"
      },
      "citys": [
        "南京",
        "无锡",
        "徐州",
        "常州",
        "苏州",
        "南通",
        "连云港",
        "淮安",
        "盐城",
        "扬州",
        "镇江",
        "泰州",
        "宿迁"
      ]
    },
    {
      "prov": {
        "name": "浙江",
        "initial": "Z",
        "fullName": "浙江省"
      },
      "citys": [
        "杭州",
        "宁波",
        "温州",
        "嘉兴",
        "湖州",
        "绍兴",
        "金华",
        "衢州",
        "舟山",
        "台州",
        "丽水"
      ]
    },
    {
      "prov": {
        "name": "安徽",
        "initial": "A",
        "fullName": "安徽省"
      },
      "citys": [
        "合肥",
        "芜湖",
        "蚌埠",
        "淮南",
        "马鞍山",
        "淮北",
        "铜陵",
        "安庆",
        "黄山",
        "滁州",
        "阜阳",
        "宿州",
        "六安",
        "亳州",
        "池州",
        "宣城"
      ]
    },
    {
      "prov": {
        "name": "福建",
        "initial": "F",
        "fullName": "福建省"
      },
      "citys": [
        "福州",
        "厦门",
        "莆田",
        "三明",
        "泉州",
        "漳州",
        "南平",
        "龙岩",
        "宁德"
      ]
    },
    {
      "prov": {
        "name": "江西",
        "initial": "J",
        "fullName": "江西省"
      },
      "citys": [
        "南昌",
        "景德镇",
        "萍乡",
        "九江",
        "新余",
        "鹰潭",
        "赣州",
        "吉安",
        "宜春",
        "抚州",
        "上饶"
      ]
    },
    {
      "prov": {
        "name": "山东",
        "initial": "S",
        "fullName": "山东省"
      },
      "citys": [
        "济南",
        "青岛",
        "淄博",
        "枣庄",
        "东营",
        "烟台",
        "潍坊",
        "济宁",
        "泰安",
        "威海",
        "日照",
        "临沂",
        "德州",
        "聊城",
        "滨州",
        "菏泽"
      ]
    },
    {
      "prov": {
        "name": "河南",
        "initial": "H",
        "fullName": "河南省"
      },
      "citys": [
        "郑州",
        "开封",
        "洛阳",
        "平顶山",
        "安阳",
        "鹤壁",
        "新乡",
        "焦作",
        "濮阳",
        "许昌",
        "漯河",
        "三门峡",
        "南阳",
        "商丘",
        "信阳",
        "周口",
        "驻马店"
      ]
    },
    {
      "prov": {
        "name": "湖北",
        "initial": "H",
        "fullName": "湖北省"
      },
      "citys": [
        "武汉",
        "黄石",
        "十堰",
        "宜昌",
        "襄阳",
        "鄂州",
        "荆门",
        "孝感",
        "荆州",
        "黄冈",
        "咸宁",
        "随州",
        "恩施"
      ]
    },
    {
      "prov": {
        "name": "湖南",
        "initial": "H",
        "fullName": "湖南省"
      },
      "citys": [
        "长沙",
        "株洲",
        "湘潭",
        "衡阳",
        "邵阳",
        "岳阳",
        "常德",
        "张家界",
        "益阳",
        "郴州",
        "永州",
        "怀化",
        "娄底",
        "湘西"
      ]
    },
    {
      "prov": {
        "name": "广东",
        "initial": "G",
        "fullName": "广东省"
      },
      "citys": [
        "广州",
        "韶关",
        "深圳",
        "珠海",
        "汕头",
        "佛山",
        "江门",
        "湛江",
        "茂名",
        "肇庆",
        "惠州",
        "梅州",
        "汕尾",
        "河源",
        "阳江",
        "清远",
        "东莞",
        "中山",
        "潮州",
        "揭阳",
        "云浮"
      ]
    },
    {
      "prov": {
        "name": "广西",
        "initial": "G",
        "fullName": "广西壮族自治区"
      },
      "citys": [
        "南宁",
        "柳州",
        "桂林",
        "梧州",
        "北海",
        "防城港",
        "钦州",
        "贵港",
        "玉林",
        "百色",
        "贺州",
        "河池",
        "来宾",
        "崇左"
      ]
    },
    {
      "prov": {
        "name": "海南",
        "initial": "H",
        "fullName": "海南省"
      },
      "citys": [
        "海口",
        "三亚",
        "三沙",
        "儋州"
      ]
    },
    {
      "prov": {
        "name": "四川",
        "initial": "S",
        "fullName": "四川省"
      },
      "citys": [
        "成都",
        "自贡",
        "攀枝花",
        "泸州",
        "德阳",
        "绵阳",
        "广元",
        "遂宁",
        "内江",
        "乐山",
        "南充",
        "眉山",
        "宜宾",
        "广安",
        "达州",
        "雅安",
        "巴中",
        "资阳",
        "阿坝",
        "甘孜",
        "凉山"
      ]
    },
    {
      "prov": {
        "name": "贵州",
        "initial": "G",
        "fullName": "贵州省"
      },
      "citys": [
        "贵阳",
        "六盘水",
        "遵义",
        "安顺",
        "毕节",
        "铜仁",
        "黔西南",
        "黔东南",
        "黔南"
      ]
    },
    {
      "prov": {
        "name": "云南",
        "initial": "Y",
        "fullName": "云南省"
      },
      "citys": [
        "昆明",
        "曲靖",
        "玉溪",
        "保山",
        "昭通",
        "丽江",
        "普洱",
        "临沧",
        "楚雄",
        "红河",
        "文山",
        "西双版纳",
        "大理",
        "德宏",
        "怒江",
        "迪庆"
      ]
    },
    {
      "prov": {
        "name": "西藏",
        "initial": "X",
        "fullName": "西藏自治区"
      },
      "citys": [
        "拉萨",
        "日喀则",
        "昌都",
        "林芝",
        "山南",
        "那曲",
        "阿里"
      ]
    },
    {
      "prov": {
        "name": "陕西",
        "initial": "S",
        "fullName": "陕西省"
      },
      "citys": [
        "西安",
        "铜川",
        "宝鸡",
        "咸阳",
        "渭南",
        "延安",
        "汉中",
        "榆林",
        "安康",
        "商洛"
      ]
    },
    {
      "prov": {
        "name": "甘肃",
        "initial": "G",
        "fullName": "甘肃省"
      },
      "citys": [
        "兰州",
        "嘉峪关",
        "金昌",
        "白银",
        "天水",
        "武威",
        "张掖",
        "平凉",
        "酒泉",
        "庆阳",
        "定西",
        "陇南",
        "临夏",
        "甘南"
      ]
    },
    {
      "prov": {
        "name": "青海",
        "initial": "Q",
        "fullName": "青海省"
      },
      "citys": [
        "西宁",
        "海东",
        "海北",
        "黄南",
        "海南",
        "果洛",
        "玉树",
        "海西"
      ]
    },
    {
      "prov": {
        "name": "宁夏",
        "initial": "N",
        "fullName": "宁夏回族自治区"
      },
      "citys": [
        "银川",
        "石嘴山",
        "吴忠",
        "固原",
        "中卫"
      ]
    },
    {
      "prov": {
        "name": "新疆",
        "initial": "X",
        "fullName": "新疆维吾尔自治区"
      },
      "citys": [
        "乌鲁木齐",
        "克拉玛依",
        "吐鲁番",
        "哈密",
        "昌吉",
        "博州",
        "巴州",
        "阿克苏",
        "克州",
        "喀什",
        "和田",
        "伊犁",
        "塔城",
        "阿勒泰"
      ]
    },
    {
      "prov": {
        "name": "台湾",
        "initial": "T",
        "fullName": "台湾省"
      },
      "citys": [
        "台北",
        "高雄",
        "台南",
        "台中",
        "南投",
        "基隆",
        "新竹",
        "嘉义",
        "新北",
        "宜兰",
        "桃园",
        "苗栗",
        "彰化",
        "云林",
        "屏东",
        "台东",
        "花莲",
        "澎湖"
      ]
    },
  ],
  "c": [
    {
      "letter": "A",
      "cities": [
        "阿坝",
        "阿克苏",
        "阿拉善",
        "阿勒泰",
        "阿里",
        "鞍山",
        "安康",
        "安庆",
        "安顺",
        "安阳",
        "澳门"
      ]
    },
    {
      "letter": "B",
      "cities": [
        "巴彦淖尔",
        "巴中",
        "巴州",
        "百色",
        "白城",
        "白山",
        "白银",
        "宝鸡",
        "包头",
        "保定",
        "保山",
        "北海",
        "北京",
        "本溪",
        "蚌埠",
        "毕节",
        "滨州",
        "博州",
        "亳州"
      ]
    },
    {
      "letter": "C",
      "cities": [
        "沧州",
        "长春",
        "长沙",
        "长治",
        "昌都",
        "昌吉",
        "常德",
        "常州",
        "潮州",
        "朝阳",
        "郴州",
        "承德",
        "成都",
        "赤峰",
        "池州",
        "重庆",
        "崇左",
        "滁州",
        "楚雄"
      ]
    },
    {
      "letter": "D",
      "cities": [
        "达州",
        "大理",
        "大连",
        "大庆",
        "大同",
        "大兴安岭",
        "儋州",
        "丹东",
        "德宏",
        "德阳",
        "德州",
        "迪庆",
        "定西",
        "东莞",
        "东营"
      ]
    },
    {
      "letter": "E",
      "cities": [
        "鄂尔多斯",
        "鄂州",
        "恩施"
      ]
    },
    {
      "letter": "F",
      "cities": [
        "防城港",
        "佛山",
        "阜新",
        "阜阳",
        "福州",
        "抚顺",
        "抚州"
      ]
    },
    {
      "letter": "G",
      "cities": [
        "赣州",
        "甘南",
        "甘孜",
        "高雄",
        "固原",
        "广安",
        "广元",
        "广州",
        "贵港",
        "贵阳",
        "桂林",
        "果洛"
      ]
    },
    {
      "letter": "H",
      "cities": [
        "哈尔滨",
        "哈密",
        "海北",
        "海东",
        "海口",
        "海南",
        "海西",
        "邯郸",
        "汉中",
        "杭州",
        "鹤壁",
        "鹤岗",
        "贺州",
        "菏泽",
        "河池",
        "河源",
        "和田",
        "合肥",
        "黑河",
        "衡水",
        "衡阳",
        "红河",
        "葫芦岛",
        "湖州",
        "呼和浩特",
        "呼伦贝尔",
        "花莲",
        "淮安",
        "淮北",
        "淮南",
        "怀化",
        "黄冈",
        "黄南",
        "黄山",
        "黄石",
        "惠州"
      ]
    },
    {
      "letter": "J",
      "cities": [
        "鸡西",
        "济南",
        "济宁",
        "基隆",
        "吉安",
        "吉林",
        "嘉兴",
        "嘉义",
        "嘉峪关",
        "佳木斯",
        "江门",
        "焦作",
        "揭阳",
        "锦州",
        "金昌",
        "金华",
        "晋城",
        "晋中",
        "荆门",
        "荆州",
        "景德镇",
        "酒泉",
        "九江"
      ]
    },
    {
      "letter": "K",
      "cities": [
        "喀什",
        "开封",
        "克拉玛依",
        "克州",
        "昆明"
      ]
    },
    {
      "letter": "L",
      "cities": [
        "拉萨",
        "来宾",
        "兰州",
        "廊坊",
        "乐山",
        "丽江",
        "丽水",
        "连云港",
        "凉山",
        "辽阳",
        "辽源",
        "聊城",
        "林芝",
        "临沧",
        "临汾",
        "临夏",
        "临沂",
        "柳州",
        "六安",
        "六盘水",
        "龙岩",
        "陇南",
        "娄底",
        "泸州",
        "漯河",
        "洛阳",
        "吕梁"
      ]
    },
    {
      "letter": "M",
      "cities": [
        "马鞍山",
        "茂名",
        "眉山",
        "梅州",
        "绵阳",
        "苗栗",
        "牡丹江"
      ]
    },
    {
      "letter": "N",
      "cities": [
        "那曲",
        "南昌",
        "南充",
        "南京",
        "南宁",
        "南平",
        "南通",
        "南投",
        "南阳",
        "内江",
        "宁波",
        "宁德",
        "怒江"
      ]
    },
    {
      "letter": "P",
      "cities": [
        "盘锦",
        "攀枝花",
        "澎湖",
        "萍乡",
        "平顶山",
        "平凉",
        "屏东",
        "莆田",
        "濮阳",
        "普洱"
      ]
    },
    {
      "letter": "Q",
      "cities": [
        "齐齐哈尔",
        "七台河",
        "黔东南",
        "黔南",
        "黔西南",
        "钦州",
        "秦皇岛",
        "青岛",
        "清远",
        "庆阳",
        "衢州",
        "曲靖",
        "泉州"
      ]
    },
    {
      "letter": "R",
      "cities": [
        "日喀则",
        "日照"
      ]
    },
    {
      "letter": "S",
      "cities": [
        "三门峡",
        "三明",
        "三沙",
        "三亚",
        "汕头",
        "汕尾",
        "山南",
        "商洛",
        "商丘",
        "上海",
        "上饶",
        "韶关",
        "邵阳",
        "绍兴",
        "深圳",
        "沈阳",
        "石家庄",
        "石嘴山",
        "十堰",
        "双鸭山",
        "朔州",
        "四平",
        "松原",
        "苏州",
        "宿迁",
        "宿州",
        "随州",
        "遂宁",
        "绥化"
      ]
    },
    {
      "letter": "T",
      "cities": [
        "塔城",
        "泰安",
        "泰州",
        "太原",
        "台北",
        "台东",
        "台南",
        "台中",
        "台州",
        "唐山",
        "桃园",
        "天津",
        "天水",
        "铁岭",
        "铜川",
        "铜陵",
        "铜仁",
        "通化",
        "通辽",
        "吐鲁番"
      ]
    },
    {
      "letter": "W",
      "cities": [
        "潍坊",
        "渭南",
        "威海",
        "温州",
        "文山",
        "芜湖",
        "武汉",
        "武威",
        "梧州",
        "无锡",
        "吴忠",
        "乌海",
        "乌兰察布",
        "乌鲁木齐"
      ]
    },
    {
      "letter": "X",
      "cities": [
        "锡林郭勒",
        "西安",
        "西宁",
        "西双版纳",
        "厦门",
        "咸宁",
        "咸阳",
        "香港",
        "襄阳",
        "湘潭",
        "湘西",
        "孝感",
        "新北",
        "新乡",
        "新余",
        "新竹",
        "忻州",
        "信阳",
        "邢台",
        "兴安",
        "许昌",
        "徐州",
        "宣城"
      ]
    },
    {
      "letter": "Y",
      "cities": [
        "雅安",
        "盐城",
        "烟台",
        "延安",
        "延边",
        "阳江",
        "阳泉",
        "扬州",
        "益阳",
        "宜宾",
        "宜昌",
        "宜春",
        "宜兰",
        "伊春",
        "伊犁",
        "银川",
        "鹰潭",
        "营口",
        "永州",
        "玉林",
        "玉树",
        "玉溪",
        "榆林",
        "岳阳",
        "运城",
        "云浮",
        "云林"
      ]
    },
    {
      "letter": "Z",
      "cities": [
        "枣庄",
        "湛江",
        "漳州",
        "彰化",
        "张家界",
        "张家口",
        "张掖",
        "肇庆",
        "昭通",
        "镇江",
        "郑州",
        "中山",
        "中卫",
        "舟山",
        "周口",
        "驻马店",
        "珠海",
        "株洲",
        "资阳",
        "自贡",
        "淄博",
        "遵义"
      ]
    }
  ]
}
export const citysStr = citys.p.map(item=>item.citys.map(item2=>(`${item.prov.fullName} ${item2}`.trimEnd()))).flat()

// let test = citys.p.map(item=>item.citys).map(a=>a.length).reduce((all, num)=> {
//   return all+num
// })
// console.log(test)
//
// test = citys.c.map(item=>item.cities).map(a=>a.length).reduce((all, num)=> {
//   return all+num
// })
// console.log(test)
